{
  "<PAD>": 0,
  "<UNK>": 1,
  "<START>": 2,
  "<EOS>": 3,
  "<GENRE_POP>": 4,
  "<GENRE_METAL>": 5,
  "<GENRE_ELECTRONIC>": 6,
  "<GENRE_ROCK>": 7,
  "<GENRE_SOUL>": 8,
  "<GENRE_PUNK>": 9,
  "<GENRE_POP ROCK>": 10,
  "<GENRE_COUNTRY>": 11,
  "<GENRE_ALTERNATIVE>": 12,
  "<GENRE_JAZZ>": 13,
  "<GENRE_RAP>": 14,
  "<GENRE_REGGAE>": 15,
  "<intro>": 4,
  "<verse>": 5,
  "<chorus>": 6,
  "<solo>": 7,
  "<bridge>": 8,
  "<outro>": 9,
  "<interlude>": 10,
  "<instrumental>": 11,
  "<intro_riff>": 12,
  "A": 25,
  "A11": 26,
  "A11b9": 27,
  "A11s": 28,
  "A13": 29,
  "A13b": 30,
  "A13b9": 31,
  "A7": 32,
  "A7b9": 33,
  "A7sus2": 34,
  "A7sus4": 35,
  "A9": 36,
  "Aadd11": 37,
  "Aadd13": 38,
  "Aadd9": 39,
  "Aaug": 40,
  "Aaugmaj7": 41,
  "Aaugmaj9": 42,
  "Ab": 43,
  "Ab11": 44,
  "Ab11s": 45,
  "Ab13": 46,
  "Ab13b": 47,
  "Ab13b9": 48,
  "Ab7": 49,
  "Ab7b9": 50,
  "Ab7sus2": 51,
  "Ab7sus4": 52,
  "Ab9": 53,
  "Abadd11": 54,
  "Abadd13": 55,
  "Abadd9": 56,
  "Abaug": 57,
  "Abaugmaj7": 58,
  "Abaugmaj9": 59,
  "Abdim": 60,
  "Abdim7": 61,
  "Abdim9": 62,
  "Abmaj13": 63,
  "Abmaj1311s": 64,
  "Abmaj7": 65,
  "Abmaj7sus2": 66,
  "Abmaj7sus4": 67,
  "Abmaj9": 68,
  "Abmaj911s": 69,
  "Abmajs9": 70,
  "Abmajs911s": 71,
  "Abmin": 72,
  "Abmin11": 73,
  "Abmin13": 74,
  "Abmin7": 75,
  "Abmin9": 76,
  "Abminadd11": 77,
  "Abminadd13": 78,
  "Abminadd9": 79,
  "Abminmaj7": 80,
  "Abno3d": 81,
  "Absus2": 82,
  "Absus4": 83,
  "Adim": 84,
  "Adim13b9": 85,
  "Adim7": 86,
  "Adim9": 87,
  "Adimb7": 88,
  "Amaj11": 89,
  "Amaj13": 90,
  "Amaj7": 91,
  "Amaj7sus2": 92,
  "Amaj7sus4": 93,
  "Amaj9": 94,
  "Amaj911s": 95,
  "Amajs9": 96,
  "Amajs911s": 97,
  "Amin": 98,
  "Amin11": 99,
  "Amin13": 100,
  "Amin7": 101,
  "Amin9": 102,
  "Aminadd11": 103,
  "Aminadd13": 104,
  "Aminadd9": 105,
  "Aminb9": 106,
  "Aminmaj7": 107,
  "Aminmaj9": 108,
  "Ano3d": 109,
  "As": 110,
  "As11": 111,
  "As13": 112,
  "As13b": 113,
  "As7": 114,
  "As7b9": 115,
  "As7sus2": 116,
  "As7sus4": 117,
  "As9": 118,
  "Asadd11": 119,
  "Asadd13": 120,
  "Asadd9": 121,
  "Asaug": 122,
  "Asaugmaj7": 123,
  "Asaugmaj9": 124,
  "Asdim": 125,
  "Asdim7": 126,
  "Asdimadd13": 127,
  "Asdimb9": 128,
  "Asmaj13": 129,
  "Asmaj7": 130,
  "Asmaj7sus2": 131,
  "Asmaj7sus4": 132,
  "Asmaj9": 133,
  "Asmaj911s": 134,
  "Asmajs9": 135,
  "Asmajs911s": 136,
  "Asmin": 137,
  "Asmin11": 138,
  "Asmin13": 139,
  "Asmin7": 140,
  "Asmin9": 141,
  "Asminadd11": 142,
  "Asminadd13": 143,
  "Asminadd9": 144,
  "Asminb9": 145,
  "Asminmaj7": 146,
  "Asminmaj9": 147,
  "Asno3d": 148,
  "Assus2": 149,
  "Assus4": 150,
  "Asus2": 151,
  "Asus4": 152,
  "B": 153,
  "B11": 154,
  "B11b9": 155,
  "B11s": 156,
  "B13": 157,
  "B13b": 158,
  "B13b9": 159,
  "B7": 160,
  "B7b9": 161,
  "B7sus2": 162,
  "B7sus4": 163,
  "B9": 164,
  "Badd11": 165,
  "Badd13": 166,
  "Badd9": 167,
  "Baug": 168,
  "Baugmaj7": 169,
  "Baugmaj9": 170,
  "Bb": 171,
  "Bb11": 172,
  "Bb11b9": 173,
  "Bb11s": 174,
  "Bb13": 175,
  "Bb13b": 176,
  "Bb13b9": 177,
  "Bb7": 178,
  "Bb7b9": 179,
  "Bb7sus2": 180,
  "Bb7sus4": 181,
  "Bb9": 182,
  "Bbadd11": 183,
  "Bbadd13": 184,
  "Bbadd9": 185,
  "Bbaug": 186,
  "Bbaugmaj7": 187,
  "Bbaugmaj9": 188,
  "Bbdim": 189,
  "Bbdim13b9": 190,
  "Bbdim7": 191,
  "Bbdim9": 192,
  "Bbdimadd13": 193,
  "Bbmaj11": 194,
  "Bbmaj13": 195,
  "Bbmaj1311s": 196,
  "Bbmaj7": 197,
  "Bbmaj7sus2": 198,
  "Bbmaj7sus4": 199,
  "Bbmaj9": 200,
  "Bbmaj911s": 201,
  "Bbmajs9": 202,
  "Bbmajs911s": 203,
  "Bbmin": 204,
  "Bbmin11": 205,
  "Bbmin13": 206,
  "Bbmin7": 207,
  "Bbmin9": 208,
  "Bbminadd11": 209,
  "Bbminadd13": 210,
  "Bbminadd9": 211,
  "Bbminmaj7": 212,
  "Bbminmaj9": 213,
  "Bbno3d": 214,
  "Bbsus2": 215,
  "Bbsus4": 216,
  "Bdim": 217,
  "Bdim11b9": 218,
  "Bdim7": 219,
  "Bdim9": 220,
  "Bdimadd13": 221,
  "Bdimb7": 222,
  "Bdimb9": 223,
  "Bmaj11": 224,
  "Bmaj13": 225,
  "Bmaj7": 226,
  "Bmaj7sus2": 227,
  "Bmaj7sus4": 228,
  "Bmaj9": 229,
  "Bmaj911s": 230,
  "Bmajs9": 231,
  "Bmajs911s": 232,
  "Bmin": 233,
  "Bmin11": 234,
  "Bmin13": 235,
  "Bmin7": 236,
  "Bmin9": 237,
  "Bminadd11": 238,
  "Bminadd13": 239,
  "Bminadd9": 240,
  "Bminb9": 241,
  "Bminmaj7": 242,
  "Bminmaj9": 243,
  "Bno3d": 244,
  "Bsus2": 245,
  "Bsus4": 246,
  "C": 247,
  "C11": 248,
  "C11s": 249,
  "C13": 250,
  "C13b": 251,
  "C13b9": 252,
  "C7": 253,
  "C7b9": 254,
  "C7sus2": 255,
  "C7sus4": 256,
  "C9": 257,
  "Cadd11": 258,
  "Cadd13": 259,
  "Cadd9": 260,
  "Caug": 261,
  "Caugmaj7": 262,
  "Caugmaj9": 263,
  "Cdim": 264,
  "Cdim7": 265,
  "Cdim9": 266,
  "Cdimadd13": 267,
  "Cdimb7": 268,
  "Cdimb9": 269,
  "Cmaj11": 270,
  "Cmaj13": 271,
  "Cmaj1311s": 272,
  "Cmaj7": 273,
  "Cmaj7sus2": 274,
  "Cmaj7sus4": 275,
  "Cmaj9": 276,
  "Cmaj911s": 277,
  "Cmajs9": 278,
  "Cmajs911s": 279,
  "Cmin": 280,
  "Cmin11": 281,
  "Cmin13": 282,
  "Cmin7": 283,
  "Cmin9": 284,
  "Cminadd11": 285,
  "Cminadd13": 286,
  "Cminadd9": 287,
  "Cminb9": 288,
  "Cminmaj11": 289,
  "Cminmaj13": 290,
  "Cminmaj7": 291,
  "Cminmaj9": 292,
  "Cno3d": 293,
  "Cs": 294,
  "Cs11": 295,
  "Cs11s": 296,
  "Cs13": 297,
  "Cs13b": 298,
  "Cs13b9": 299,
  "Cs7": 300,
  "Cs7b9": 301,
  "Cs7sus2": 302,
  "Cs7sus4": 303,
  "Cs9": 304,
  "Csadd11": 305,
  "Csadd13": 306,
  "Csadd9": 307,
  "Csaug": 308,
  "Csaugmaj7": 309,
  "Csaugmaj9": 310,
  "Csdim": 311,
  "Csdim7": 312,
  "Csdim9": 313,
  "Csdimadd11": 314,
  "Csdimb7": 315,
  "Csdimb9": 316,
  "Csmaj11": 317,
  "Csmaj13": 318,
  "Csmaj7": 319,
  "Csmaj7sus2": 320,
  "Csmaj9": 321,
  "Csmaj911s": 322,
  "Csmajs9": 323,
  "Csmajs911s": 324,
  "Csmin": 325,
  "Csmin11": 326,
  "Csmin13": 327,
  "Csmin7": 328,
  "Csmin9": 329,
  "Csminadd11": 330,
  "Csminadd13": 331,
  "Csminadd9": 332,
  "Csminb9": 333,
  "Csminmaj7": 334,
  "Csno3d": 335,
  "Cssus2": 336,
  "Cssus4": 337,
  "Csus2": 338,
  "Csus4": 339,
  "D": 340,
  "D11": 341,
  "D11s": 342,
  "D13": 343,
  "D13b": 344,
  "D13b9": 345,
  "D7": 346,
  "D7b9": 347,
  "D7sus2": 348,
  "D7sus4": 349,
  "D9": 350,
  "Dadd11": 351,
  "Dadd13": 352,
  "Dadd9": 353,
  "Daug": 354,
  "Daugmaj7": 355,
  "Daugmaj9": 356,
  "Db": 357,
  "Db11": 358,
  "Db11s": 359,
  "Db13": 360,
  "Db13b": 361,
  "Db13b9": 362,
  "Db7": 363,
  "Db7b9": 364,
  "Db7sus2": 365,
  "Db7sus4": 366,
  "Db9": 367,
  "Dbadd11": 368,
  "Dbadd13": 369,
  "Dbadd9": 370,
  "Dbaug": 371,
  "Dbaugmaj7": 372,
  "Dbdim": 373,
  "Dbdim7": 374,
  "Dbdim9": 375,
  "Dbmaj11": 376,
  "Dbmaj13": 377,
  "Dbmaj7": 378,
  "Dbmaj7sus2": 379,
  "Dbmaj9": 380,
  "Dbmaj911s": 381,
  "Dbmajs9": 382,
  "Dbmajs911s": 383,
  "Dbmin": 384,
  "Dbmin11": 385,
  "Dbmin13": 386,
  "Dbmin7": 387,
  "Dbmin9": 388,
  "Dbminadd13": 389,
  "Dbminadd9": 390,
  "Dbminmaj7": 391,
  "Dbno3d": 392,
  "Dbsus2": 393,
  "Dbsus4": 394,
  "Ddim": 395,
  "Ddim7": 396,
  "Ddim9": 397,
  "Ddimb7": 398,
  "Ddimb9": 399,
  "Dmaj11": 400,
  "Dmaj13": 401,
  "Dmaj1311s": 402,
  "Dmaj7": 403,
  "Dmaj7sus2": 404,
  "Dmaj7sus4": 405,
  "Dmaj9": 406,
  "Dmaj911s": 407,
  "Dmajs9": 408,
  "Dmajs911s": 409,
  "Dmin": 410,
  "Dmin11": 411,
  "Dmin13": 412,
  "Dmin7": 413,
  "Dmin9": 414,
  "Dminadd11": 415,
  "Dminadd13": 416,
  "Dminadd9": 417,
  "Dminb9": 418,
  "Dminmaj7": 419,
  "Dminmaj9": 420,
  "Dno3d": 421,
  "Ds": 422,
  "Ds11": 423,
  "Ds13": 424,
  "Ds7": 425,
  "Ds7b9": 426,
  "Ds7sus2": 427,
  "Ds7sus4": 428,
  "Ds9": 429,
  "Dsadd11": 430,
  "Dsadd13": 431,
  "Dsadd9": 432,
  "Dsaug": 433,
  "Dsaugmaj7": 434,
  "Dsdim": 435,
  "Dsdim7": 436,
  "Dsdim9": 437,
  "Dsmaj11": 438,
  "Dsmaj13": 439,
  "Dsmaj7": 440,
  "Dsmaj7sus2": 441,
  "Dsmaj9": 442,
  "Dsmajs9": 443,
  "Dsmin": 444,
  "Dsmin11": 445,
  "Dsmin13": 446,
  "Dsmin7": 447,
  "Dsmin9": 448,
  "Dsminadd11": 449,
  "Dsminadd13": 450,
  "Dsminadd9": 451,
  "Dsminb9": 452,
  "Dsminmaj7": 453,
  "Dsno3d": 454,
  "Dssus2": 455,
  "Dssus4": 456,
  "Dsus2": 457,
  "Dsus4": 458,
  "E": 459,
  "E11": 460,
  "E11b9": 461,
  "E11s": 462,
  "E13": 463,
  "E13b": 464,
  "E13b9": 465,
  "E7": 466,
  "E7b9": 467,
  "E7sus2": 468,
  "E7sus4": 469,
  "E9": 470,
  "Eadd11": 471,
  "Eadd13": 472,
  "Eadd9": 473,
  "Eaug": 474,
  "Eaugmaj7": 475,
  "Eaugmaj9": 476,
  "Eb": 477,
  "Eb11": 478,
  "Eb11b9": 479,
  "Eb11s": 480,
  "Eb13": 481,
  "Eb13b": 482,
  "Eb13b9": 483,
  "Eb7": 484,
  "Eb7b9": 485,
  "Eb7sus2": 486,
  "Eb7sus4": 487,
  "Eb9": 488,
  "Ebadd11": 489,
  "Ebadd13": 490,
  "Ebadd9": 491,
  "Ebaug": 492,
  "Ebaugmaj7": 493,
  "Ebaugmaj9": 494,
  "Ebdim": 495,
  "Ebdim7": 496,
  "Ebdim9": 497,
  "Ebmaj11": 498,
  "Ebmaj13": 499,
  "Ebmaj1311s": 500,
  "Ebmaj7": 501,
  "Ebmaj7sus2": 502,
  "Ebmaj9": 503,
  "Ebmaj911s": 504,
  "Ebmajs9": 505,
  "Ebmajs911s": 506,
  "Ebmin": 507,
  "Ebmin11": 508,
  "Ebmin13": 509,
  "Ebmin7": 510,
  "Ebmin9": 511,
  "Ebminadd11": 512,
  "Ebminadd13": 513,
  "Ebminadd9": 514,
  "Ebminmaj7": 515,
  "Ebminmaj9": 516,
  "Ebno3d": 517,
  "Ebsus2": 518,
  "Ebsus4": 519,
  "Edim": 520,
  "Edim7": 521,
  "Edim9": 522,
  "Edimadd13": 523,
  "Edimb7": 524,
  "Edimb9": 525,
  "Emaj11": 526,
  "Emaj13": 527,
  "Emaj7": 528,
  "Emaj7sus2": 529,
  "Emaj7sus4": 530,
  "Emaj9": 531,
  "Emaj911s": 532,
  "Emajs9": 533,
  "Emajs911s": 534,
  "Emin": 535,
  "Emin11": 536,
  "Emin1113b": 537,
  "Emin13": 538,
  "Emin7": 539,
  "Emin9": 540,
  "Eminadd11": 541,
  "Eminadd13": 542,
  "Eminadd9": 543,
  "Eminb9": 544,
  "Eminmaj11": 545,
  "Eminmaj13": 546,
  "Eminmaj7": 547,
  "Eminmaj9": 548,
  "Eno3d": 549,
  "Esus2": 550,
  "Esus4": 551,
  "F": 552,
  "F11": 553,
  "F11b9": 554,
  "F11s": 555,
  "F13": 556,
  "F13b": 557,
  "F13b9": 558,
  "F7": 559,
  "F7b9": 560,
  "F7sus2": 561,
  "F7sus4": 562,
  "F9": 563,
  "Fadd11": 564,
  "Fadd13": 565,
  "Fadd9": 566,
  "Faug": 567,
  "Faugmaj7": 568,
  "Faugmaj9": 569,
  "Fdim": 570,
  "Fdim7": 571,
  "Fdim9": 572,
  "Fdimadd13": 573,
  "Fmaj11": 574,
  "Fmaj13": 575,
  "Fmaj1311s": 576,
  "Fmaj7": 577,
  "Fmaj7sus2": 578,
  "Fmaj7sus4": 579,
  "Fmaj9": 580,
  "Fmaj911s": 581,
  "Fmajs9": 582,
  "Fmajs911s": 583,
  "Fmin": 584,
  "Fmin11": 585,
  "Fmin13": 586,
  "Fmin7": 587,
  "Fmin9": 588,
  "Fminadd11": 589,
  "Fminadd13": 590,
  "Fminadd9": 591,
  "Fminb9": 592,
  "Fminmaj11": 593,
  "Fminmaj13": 594,
  "Fminmaj7": 595,
  "Fminmaj9": 596,
  "Fno3d": 597,
  "Fs": 598,
  "Fs11": 599,
  "Fs11b9": 600,
  "Fs13": 601,
  "Fs13b": 602,
  "Fs13b9": 603,
  "Fs7": 604,
  "Fs7b9": 605,
  "Fs7sus2": 606,
  "Fs7sus4": 607,
  "Fs9": 608,
  "Fsadd11": 609,
  "Fsadd13": 610,
  "Fsadd9": 611,
  "Fsaug": 612,
  "Fsaugmaj11": 613,
  "Fsaugmaj7": 614,
  "Fsaugmaj9": 615,
  "Fsdim": 616,
  "Fsdim11": 617,
  "Fsdim7": 618,
  "Fsdim9": 619,
  "Fsmaj11": 620,
  "Fsmaj13": 621,
  "Fsmaj7": 622,
  "Fsmaj7sus2": 623,
  "Fsmaj7sus4": 624,
  "Fsmaj9": 625,
  "Fsmaj911s": 626,
  "Fsmajs9": 627,
  "Fsmajs911s": 628,
  "Fsmin": 629,
  "Fsmin11": 630,
  "Fsmin13": 631,
  "Fsmin7": 632,
  "Fsmin9": 633,
  "Fsminadd11": 634,
  "Fsminadd13": 635,
  "Fsminadd9": 636,
  "Fsminb9": 637,
  "Fsminmaj13": 638,
  "Fsminmaj7": 639,
  "Fsminmaj9": 640,
  "Fsno3d": 641,
  "Fssus2": 642,
  "Fssus4": 643,
  "Fsus2": 644,
  "Fsus4": 645,
  "G": 646,
  "G11": 647,
  "G11b9": 648,
  "G11s": 649,
  "G13": 650,
  "G13b": 651,
  "G13b9": 652,
  "G7": 653,
  "G7b9": 654,
  "G7sus2": 655,
  "G7sus4": 656,
  "G9": 657,
  "Gadd11": 658,
  "Gadd13": 659,
  "Gadd9": 660,
  "Gaug": 661,
  "Gaugmaj7": 662,
  "Gaugmaj9": 663,
  "Gb": 664,
  "Gb11": 665,
  "Gb11s": 666,
  "Gb13": 667,
  "Gb13b": 668,
  "Gb13b9": 669,
  "Gb7": 670,
  "Gb7b9": 671,
  "Gb7sus4": 672,
  "Gb9": 673,
  "Gbadd11": 674,
  "Gbadd13": 675,
  "Gbadd9": 676,
  "Gbaug": 677,
  "Gbaugmaj7": 678,
  "Gbdim": 679,
  "Gbdim7": 680,
  "Gbmaj11": 681,
  "Gbmaj13": 682,
  "Gbmaj1311s": 683,
  "Gbmaj7": 684,
  "Gbmaj7sus2": 685,
  "Gbmaj7sus4": 686,
  "Gbmaj9": 687,
  "Gbmaj911s": 688,
  "Gbmajs9": 689,
  "Gbmajs911s": 690,
  "Gbmin": 691,
  "Gbmin11": 692,
  "Gbmin13": 693,
  "Gbmin7": 694,
  "Gbmin9": 695,
  "Gbminadd13": 696,
  "Gbminadd9": 697,
  "Gbminmaj7": 698,
  "Gbno3d": 699,
  "Gbsus2": 700,
  "Gbsus4": 701,
  "Gdim": 702,
  "Gdim11b9": 703,
  "Gdim7": 704,
  "Gdim9": 705,
  "Gmaj11": 706,
  "Gmaj13": 707,
  "Gmaj1311s": 708,
  "Gmaj7": 709,
  "Gmaj7sus2": 710,
  "Gmaj7sus4": 711,
  "Gmaj9": 712,
  "Gmaj911s": 713,
  "Gmajs9": 714,
  "Gmajs911s": 715,
  "Gmin": 716,
  "Gmin11": 717,
  "Gmin13": 718,
  "Gmin7": 719,
  "Gmin9": 720,
  "Gminadd11": 721,
  "Gminadd13": 722,
  "Gminadd9": 723,
  "Gminb9": 724,
  "Gminmaj7": 725,
  "Gminmaj9": 726,
  "Gno3d": 727,
  "Gs": 728,
  "Gs11": 729,
  "Gs13": 730,
  "Gs13b": 731,
  "Gs13b9": 732,
  "Gs7": 733,
  "Gs7b9": 734,
  "Gs7sus2": 735,
  "Gs7sus4": 736,
  "Gs9": 737,
  "Gsadd11": 738,
  "Gsadd13": 739,
  "Gsadd9": 740,
  "Gsaug": 741,
  "Gsaugmaj7": 742,
  "Gsaugmaj9": 743,
  "Gsdim": 744,
  "Gsdim7": 745,
  "Gsdim9": 746,
  "Gsdimb7": 747,
  "Gsdimb9": 748,
  "Gsmaj11": 749,
  "Gsmaj13": 750,
  "Gsmaj7": 751,
  "Gsmaj9": 752,
  "Gsmaj911s": 753,
  "Gsmajs9": 754,
  "Gsmajs911s": 755,
  "Gsmin": 756,
  "Gsmin11": 757,
  "Gsmin1113b": 758,
  "Gsmin13": 759,
  "Gsmin7": 760,
  "Gsmin9": 761,
  "Gsminadd11": 762,
  "Gsminadd13": 763,
  "Gsminadd9": 764,
  "Gsminb9": 765,
  "Gsminmaj7": 766,
  "Gsminmaj9": 767,
  "Gsno3d": 768,
  "Gssus2": 769,
  "Gssus4": 770,
  "Gsus2": 771,
  "Gsus4": 772,
  "sC": 773
}